; domain
(define
  (domain BLOCKS)
  (:requirements :strips :typing :equality)
  (:types block)
  (:constants S T A R H C U K - block)
  (:predicates (on ?x ?y - block) (ontable ?x - block) (clear ?x - block) (handempty) (holding ?x - block) (obs_0) (obs_1))
  (:action pick-up :parameters (?x - block) :precondition (and (clear ?x) (ontable ?x) (handempty)) :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x)))
  (:action put-down :parameters (?x - block) :precondition (holding ?x) :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x)))
  (:action stack :parameters (?x ?y - block) :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y))) :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y)))
  (:action unstack :parameters (?x ?y - block) :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y))) :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y))))
  (:action unstack__obs1 :parameters () :precondition (and (on s a) (clear s) (handempty) (not (= s a)) (obs_0)) :effect (and (holding s) (clear a) (not (clear s)) (not (handempty)) (not (on s a)) (obs_1)))
)

; problem
(define (problem blocks_words)
(:domain blocks)
(:objects

S T A R H C U K - block
)
(:init
(HANDEMPTY)
(CLEAR T)
(ONTABLE T)
(CLEAR U)
(ONTABLE U)
(CLEAR R)
(ONTABLE R)
(CLEAR K)
(ONTABLE K)
(CLEAR C)
(ONTABLE C)
(CLEAR S)
(ON S A)
(ON A H)
(ONTABLE H)
)
(:goal (and
(CLEAR C)
(ONTABLE H)
(ON C A)
(ON A S)
(ON S H)
))
)

; plan
1. (unstack s a)
   deleted: (clear s) (handempty) (on s a)
   added: (holding s) (clear a)
   goals met: 2 of 5
2. (stack s k)
   deleted: (holding s) (clear k)
   added: (clear s) (handempty) (on s k)
   goals met: 2 of 5
3. (unstack a h)
   deleted: (clear a) (handempty) (on a h)
   added: (holding a) (clear h)
   goals met: 2 of 5
4. (stack a r)
   deleted: (holding a) (clear r)
   added: (clear a) (handempty) (on a r)
   goals met: 2 of 5
5. (unstack s k)
   deleted: (clear s) (handempty) (on s k)
   added: (holding s) (clear k)
   goals met: 2 of 5
6. (stack s h)
   deleted: (holding s) (clear h)
   added: (clear s) (handempty) (on s h)
   goals met: 3 of 5
7. (unstack a r)
   deleted: (clear a) (handempty) (on a r)
   added: (holding a) (clear r)
   goals met: 3 of 5
8. (stack a s)
   deleted: (holding a) (clear s)
   added: (clear a) (handempty) (on a s)
   goals met: 4 of 5
9. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 3 of 5
10. (stack c a)
   deleted: (holding c) (clear a)
   added: (clear c) (handempty) (on c a)
   goals met: 5 of 5
